Merge pull request #1 from codenamekt/docs/revamp-and-v0.9.0
Docs/revamp and v0.9.0
